; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
  (:predicates
    (clear ?x)
    (on-table ?x)
    (arm-empty)
    (holding ?x)
    (on ?x ?y)
  )

  (:action pickup
    :parameters (?ob)
    :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
    :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
      (not (arm-empty)))
  )

  (:action putdown
    :parameters (?ob)
    :precondition (holding ?ob)
    :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
      (not (holding ?ob)))
  )

  (:action stack
    :parameters (?ob ?underob)
    :precondition (and (clear ?underob) (holding ?ob))
    :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
      (not (clear ?underob)) (not (holding ?ob)))
  )

  (:action unstack
    :parameters (?ob ?underob)
    :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
    :effect (and (holding ?ob) (clear ?underob)
      (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))
  )
)

; problem
(define (problem BW-rand-22)
(:domain blocksworld-4ops)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 )
(:init
(arm-empty)
(on b1 b12)
(on b2 b1)
(on b3 b15)
(on b4 b20)
(on b5 b8)
(on-table b6)
(on b7 b14)
(on-table b8)
(on b9 b4)
(on b10 b9)
(on-table b11)
(on-table b12)
(on b13 b6)
(on b14 b21)
(on b15 b22)
(on-table b16)
(on b17 b5)
(on b18 b7)
(on b19 b2)
(on b20 b3)
(on b21 b17)
(on b22 b16)
(clear b10)
(clear b11)
(clear b13)
(clear b18)
(clear b19)
)
(:goal
(and
(on b1 b22)
(on b3 b13)
(on b4 b14)
(on b5 b1)
(on b7 b6)
(on b8 b12)
(on b9 b17)
(on b11 b7)
(on b12 b15)
(on b13 b9)
(on b14 b21)
(on b16 b8)
(on b17 b5)
(on b18 b16)
(on b20 b11)
(on b21 b19)
(on b22 b20))
)
)

; plan
1. (unstack b13 b6)
   deleted: (on b13 b6) (clear b13) (arm-empty)
   added: (holding b13) (clear b6)
   goals met: 2 of 17
2. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 2 of 17
3. (unstack b18 b7)
   deleted: (on b18 b7) (clear b18) (arm-empty)
   added: (holding b18) (clear b7)
   goals met: 2 of 17
4. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 2 of 17
5. (unstack b7 b14)
   deleted: (on b7 b14) (clear b7) (arm-empty)
   added: (holding b7) (clear b14)
   goals met: 2 of 17
6. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 2 of 17
7. (unstack b14 b21)
   deleted: (on b14 b21) (clear b14) (arm-empty)
   added: (holding b14) (clear b21)
   goals met: 1 of 17
8. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 1 of 17
9. (unstack b21 b17)
   deleted: (on b21 b17) (clear b21) (arm-empty)
   added: (holding b21) (clear b17)
   goals met: 1 of 17
10. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 1 of 17
11. (unstack b17 b5)
   deleted: (on b17 b5) (clear b17) (arm-empty)
   added: (holding b17) (clear b5)
   goals met: 0 of 17
12. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 17
13. (unstack b5 b8)
   deleted: (on b5 b8) (clear b5) (arm-empty)
   added: (holding b5) (clear b8)
   goals met: 0 of 17
14. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 17
15. (unstack b19 b2)
   deleted: (on b19 b2) (clear b19) (arm-empty)
   added: (holding b19) (clear b2)
   goals met: 0 of 17
16. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 17
17. (unstack b2 b1)
   deleted: (on b2 b1) (clear b2) (arm-empty)
   added: (holding b2) (clear b1)
   goals met: 0 of 17
18. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 17
19. (unstack b1 b12)
   deleted: (on b1 b12) (clear b1) (arm-empty)
   added: (holding b1) (clear b12)
   goals met: 0 of 17
20. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 17
21. (unstack b10 b9)
   deleted: (on b10 b9) (clear b10) (arm-empty)
   added: (holding b10) (clear b9)
   goals met: 0 of 17
22. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 0 of 17
23. (unstack b9 b4)
   deleted: (on b9 b4) (clear b9) (arm-empty)
   added: (holding b9) (clear b4)
   goals met: 0 of 17
24. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 17
25. (unstack b4 b20)
   deleted: (on b4 b20) (clear b4) (arm-empty)
   added: (holding b4) (clear b20)
   goals met: 0 of 17
26. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 17
27. (unstack b20 b3)
   deleted: (on b20 b3) (clear b20) (arm-empty)
   added: (holding b20) (clear b3)
   goals met: 0 of 17
28. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 0 of 17
29. (unstack b3 b15)
   deleted: (on b3 b15) (clear b3) (arm-empty)
   added: (holding b3) (clear b15)
   goals met: 0 of 17
30. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 17
31. (unstack b15 b22)
   deleted: (on b15 b22) (clear b15) (arm-empty)
   added: (holding b15) (clear b22)
   goals met: 0 of 17
32. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 0 of 17
33. (unstack b22 b16)
   deleted: (on b22 b16) (clear b22) (arm-empty)
   added: (holding b22) (clear b16)
   goals met: 0 of 17
34. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 17
35. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 0 of 17
36. (stack b12 b15)
   deleted: (clear b15) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b15)
   goals met: 1 of 17
37. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 1 of 17
38. (stack b8 b12)
   deleted: (clear b12) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b12)
   goals met: 2 of 17
39. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 2 of 17
40. (stack b16 b8)
   deleted: (clear b8) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b8)
   goals met: 3 of 17
41. (pickup b18)
   deleted: (clear b18) (on-table b18) (arm-empty)
   added: (holding b18)
   goals met: 3 of 17
42. (stack b18 b16)
   deleted: (clear b16) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b16)
   goals met: 4 of 17
43. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 4 of 17
44. (stack b7 b6)
   deleted: (clear b6) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b6)
   goals met: 5 of 17
45. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 5 of 17
46. (stack b11 b7)
   deleted: (clear b7) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b7)
   goals met: 6 of 17
47. (pickup b20)
   deleted: (clear b20) (on-table b20) (arm-empty)
   added: (holding b20)
   goals met: 6 of 17
48. (stack b20 b11)
   deleted: (clear b11) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b11)
   goals met: 7 of 17
49. (pickup b22)
   deleted: (clear b22) (on-table b22) (arm-empty)
   added: (holding b22)
   goals met: 7 of 17
50. (stack b22 b20)
   deleted: (clear b20) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b20)
   goals met: 8 of 17
51. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 8 of 17
52. (stack b1 b22)
   deleted: (clear b22) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b22)
   goals met: 9 of 17
53. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 9 of 17
54. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 10 of 17
55. (pickup b17)
   deleted: (clear b17) (on-table b17) (arm-empty)
   added: (holding b17)
   goals met: 10 of 17
56. (stack b17 b5)
   deleted: (clear b5) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b5)
   goals met: 11 of 17
57. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 11 of 17
58. (stack b9 b17)
   deleted: (clear b17) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b17)
   goals met: 12 of 17
59. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 12 of 17
60. (stack b13 b9)
   deleted: (clear b9) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b9)
   goals met: 13 of 17
61. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 13 of 17
62. (stack b3 b13)
   deleted: (clear b13) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b13)
   goals met: 14 of 17
63. (pickup b21)
   deleted: (clear b21) (on-table b21) (arm-empty)
   added: (holding b21)
   goals met: 14 of 17
64. (stack b21 b19)
   deleted: (clear b19) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b19)
   goals met: 15 of 17
65. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 15 of 17
66. (stack b14 b21)
   deleted: (clear b21) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b21)
   goals met: 16 of 17
67. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 16 of 17
68. (stack b4 b14)
   deleted: (clear b14) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b14)
   goals met: 17 of 17
